## This workbook is for my notes on the absolute basics of MySQL, databases and tables

Review goals:

- Fully understand basic vocabulary

- Know the syntax to show, create, and describe tables

- Lay out the most used data types in SQL

- Go over primary keys

Some vocabulary to start:

- RDBMS: Relational Database Management System; the software that manages the data and runs the server (handles storage and retrieval)

- Database: The actual location of the data stored on a disk; won't be interacted with directly, it will be via the DBMS

- Database Client: A program that is used to connect to a database. They are many and varied.

- Database Server: A computer that runs the DMBS and stores the data, usually on-site or through a cloud serivce

- DDL: Data definition language; the actual commands that change the structure of the database or DMBS itself, or changes the structures of the tables within the database

- DML: Data manipulation language; used to insert, update, delete, and retrieve information from databases

There is some confusion between the words 'Database'  and 'Schema', especially when reading the documentation. Other RDBMS's use schemas as a second level of organization *within* a database and as separate databases from each other to the user's perspective. Within MySQL, the words are used interchangably.

There are reserved words within MySQL, like `SELECT`, `CREATE`, and `INSERT`. Reserved words can't be used within a query to refer to things like a table name, a column name, or a database itself. This is because they have a specific defined use within the language. [Click here](https://dev.mysql.com/doc/refman/8.0/en/keywords.html) for full list of reserved words. Although it's simply a bad idea to use reserved words as a name for anything in SQL, so as to avoid confusion, there is a workaround. You simply need to enclose the name of whatever it is you're calling within backticks. 

Another important thing to note would be the idea of data types. MySQL has a variety of data types, but the most common numeric types here are:

- `INT`: An integer, or any number *without* a decimal point.
    
- `FLOAT`:  A number *with* decimal points.
    
- `DECIMAL`: A *precise* decimal number. A decimal column must have a defined length and a precision; a length being the total number of digits stored for any given value, and a precision being the number of digits after the decimal place. something like `DECIMAL(3, 1)` would be a double digit number with a single digit after the decimal, like 11.1, or 99.7.
    
- `UNSIGNED`: When declaring numeric columns, you can specify that the values are `UNSIGNED`. This will allow you to potentiall store larger numbers in a column, but they can only be positive values. For example, a normal `INT` column can store a number between `-2,147,483,648` to `2,147,483,648`, but an `INT UNSIGNED` column can store from `0` to `4,294,967,295`.
    
- `Boolean`: MySQL doesn't have support for boolean values, and instead uses `TINYINT`, which goes from `-128` to `127`, and treats `0` as `false` and `1` as `true`.
    
Another section of data types would be the string data type. Strings are generally signified by single quotes (`'`). In MySQL, there are several different data types when it comes to strings:

- `CHAR(length)`: A string with a fixed number of characters (hence the length), where length can be from 1 to 255. If a string shorter than the specified length is stored within the column then the value is padded with empty space to fill it up to the length. It will give an error if you try to store a string longer than the length. 
    
- `VARCHAR(length)`: For strings where the length could vary up to a maximum length. Goes up to 65,535, but if you need to go beyond 255, `TEXT` is recommended. 
    
- `TEXT`: A large block of characters that can be any length. It could seem tempting to just use `TEXT` whenever dealing with strings, but there are major technical limitations to using it and can cause performance issues if overused. Use it for very large blocks of text, like an article, or the pages of a book.
    
A third set of data types within MySQL are Date/time data types, the most common of which are:

- `DATE`: A date value without a timestamp, usually displayed as `YYYY-MM-DD`.

- `TIME`: A time down to the second, using a 24 hour clock.

- `DATETIME`: A combined date and time value, displayed as `YYYY-MM-DD HH:MM:SS`

And last, but not least, `NULL` values. In most languages, `NULL` behaves like a 0, however in MySQL, it is better thought of as the absence of a value, which is intersting. Since `NULL` values are complex, and because they sometimes lead to inconsistent data, columns can be specified that their values are `NOT NULL`. This will prevent `NULL` from being stored in that particular column.

## Basic navigation using a MySQL GUI:

```sql
SHOW DATABASES;
```

This will give a basic table of the different databases within the server that are accessible for the current user

```sql
SELECT database();
```
This will select a specific database from within the server for use

```sql
SHOW CREATE DATABASE database_name;
```
This will show the exact SQL command that was used to create the database. Good for if you want to recreate a database elsewhere for duplication

```sql
SHOW TABLES;
```
This command will show the tables within a database

Sometimes, you might n eed to refer to another table or object within anoher database within the server. The syntax for that is simply `database_name.table_name`. 
A simple example might be:
```sql
SELECT *
FROM other_database.table2
```

## Creating a simple table

```sql
CREATE TABLE table_name(column1_name, data_type,
                        column2_name, data_type
                        ...
                        );
```

A basic statement to create a table. A more realistic example could be:

```sql
CREATE TABLE quotes(author_first_name VARCHAR(50),
                    author_last_name VARCHAR(100) NOT NULL,
                    content TEXT NOT NULL
                    );
```

This example is not quite complete, because we need a primary key for our table. A primary key is a special column type with several important rules:

- Each value is unique

- They cannot be null

- There can only be one primary key in the table

So a more complete example query for this would be:

```sql
CREATE TABLE quotes(id INT UNSIGNED NOT NULL AUTO_INCREMENT,
                    author_first_name VARCHAR(50),
                    author_last_name VARCHAR(100) NOT NULL,
                    content TEXT NOT NULL,
                    PRIMARY KEY (id)
                    (;
```

In this case, the id column is just like the others, however we've added some additional constraints to it. It's an `UNSIGNED` column, because it can't be negative and will therefore start at 1. `AUTO_INCREMENT` instructs MySQL to generate new values for this column we we insert new records into the table (counting up from 1) Only one column per table can have `AUTO_INCREMENT`, and it must be the `PRIMARY KEY`.